tests/com/l7tech/service/resources/websphereSignedRequest.xml

<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext" soapenv:mustUnderstand="1">
      <wsse:BinarySecurityToken xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" EncodingType="wsse:Base64Binary" ValueType="wsse:X509v3" wsu:Id="wssecurity_binary_security_token_id_1169629248054106215">
        MIIBnzCCAQigAwIBAgICAeUwDQYJKoZIhvcNAQEFBQAwGzEZMBcGA1UEAxMQRmlzaHkgQ2VydHMg
        SW5jLjAeFw03MDAxMDEwMDAwMDBaFw0yNTA4MjkwNTAwNTBaMA8xDTALBgNVBAMTBHdzYWQwgZ8w
        DQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAK03qg7kmzkSN/kXh/OQnURIEzOAPlcxdQARToQtfXgZ
        uN/jfIgMWwK240OyrdecArLE+k5OWyDNMT+M81+WiIvgSn/iFzuOWQdnq5AmsN1npkwXlYBJphIJ
        gUA14S90KIzuqYgxoHlYf0DTI9BnNEh6xLzf+BgHz1/zS1bwEF37AgMBAAEwDQYJKoZIhvcNAQEF
        BQADgYEAVfs8nqzMpfDToVFG6diwks7bm/T9/8Ex5HjrOOCNxrGOqbSFlWBuCn7EhMI2pa48e+yK
        Zr5Ntw8eTwmY37L7vewNF1dCCvXJnD/dm2AITxd9WoyurP9vNSIV22C/WlKhOBbdLCBx2tWczusb
        c33xOmYrMSBVDpxe5JPPnzrsUDQ=
      </wsse:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
          <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></SignatureMethod>
          <Reference URI="#wssecurity_body_id_9119552724904345093">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsi soapenc xsd #default wsu soapenv "></ec:InclusiveNamespaces>
              </Transform>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
            <DigestValue>sV+8Wjws3RtZzVRqW7pe1HxzBZU=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
                SA/KL5LekjhQlzxpT+JpcoJOlhEW9elzdw5oKrz0BmYKqVGDVtmW5jqQ/YRn
                gZoT/+RAvpFc1GN/PEeMlacexSI7DCfbev7reZVoggwZwPzNmcP7dcoj77P/
                hqAqIist2jRG/yz5CRTjtFfnXOMYt4pZUspxPpgoGr8Y0YKJY+c=
        </SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#wssecurity_binary_security_token_id_1169629248054106215"></wsse:Reference>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" wsu:Id="wssecurity_body_id_9119552724904345093"><getTheTime xmlns="http://acpkg"></getTheTime></soapenv:Body></soapenv:Envelope>